# 6.3 Interacting with Databases

In [1]:
import numpy as np
import pandas as pd

In [2]:
import sqlite3

In [3]:
query = """
CREATE TABLE test(
a VARCHAR(20), 
b VARCHAR(20),
c REAL,
d INTEGER
);"""

In [4]:
con = sqlite3.connect('mydata.sqlite')

In [6]:
con.execute(query)

In [7]:
con.commit()

In [8]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [9]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [10]:
con.executemany(stmt, data)

In [11]:
con.commit()

In [12]:
cursor = con.execute('select * from test')

In [13]:
rows = cursor.fetchall()

In [14]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [15]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [16]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

The SQLAlchemy project is a popular Python SQL toolkit that abstracts
away many of the common differences between SQL databases. pandas has a
read_sql function that enables you to read data easily from a general SQLAlchemy
connection. Here, weâ€™ll connect to the same SQLite database with SQLAlchemy and
read data from the table created before:

In [17]:
import sqlalchemy as sqla

In [20]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [21]:
type(db)

sqlalchemy.engine.base.Engine

In [22]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5